[
  {
    "title": "Associate",
    "span": "Operations",
    "job_description": "You will be leading all operations at Impact Hub Dhaka with an aim to improve the company’s overall efficiency and effectiveness while bringing together entrepreneurs, enablers, and leaders from all across Bangladesh to create a vibrant community of social innovation enthusiasts. You will support daily management of Impact Hub Dhaka where we offer inspiring workspaces, community-led events, diverse network, entrepreneurship programs and consulting services to bring sustainable solutions that create impact and drive change.",
    "educational_requirements": [
      "Oversee daily operations of Impact Hub Dhaka to ensure that the organisation effectively and efficiently meets the needs of all stakeholders such as members, clients, partners, etc.",
      "Organize physical, virtual, and hybrid events such as conferences, forums, panels, boot camps, community meet-ups, etc. hosted in partnership with members and clients.",
      "Support with planning, implementation, and execution of projects and other new strategic initiatives, including management of some aspects of programs run by Impact Hub Dhaka.",
      "Develop appropriate systems, structures, and processes to increase the efficiency of services offered at Impact Hub Dhaka, and record the outcomes, impact, and outreach for reporting.",
      "Support in creating content for print, digital and social media to engage diverse stakeholders.",
      "Manage and grow the brand of Impact Hub Dhaka through effective marketing and communications leveraging the power of storytelling on print, digital and social media.",
      "Support the Community Lead by networking and building relationships with customers and engage with the start-up ecosystem to ensure sustainability of the organisation and establish strategic partnerships for business development.",
      "Manage office petty cash, track daily income and expenditures, and ensure timely cash requisitions and reimbursements to support the Finance and Accounts Manager execute an effective process of financial management of Impact Hub Dhaka."
    ],
    "qualifications": [
      "At least 2 years of work experience in operations, event management, or similar roles at fast-paced organizations, with some progressive experience in managing people and projects.",
      "Outstanding communication skills and fluency in both English and Bangla languages.",
      "Excellent organizational skills, and the ability to effectively prioritise competing tasks and manage multiple projects simultaneously while paying full attention to details.",
      "Strong interpersonal, management and negotiation skills proven through effective interaction with internal and external stakeholders, including partners from the global Impact Hub network.",
      "Superb strategic thinking skills, a proven ability to think critically and creatively, strong business acumen, and a knack for building efficient systems, structures, and processes.",
      "A university degree from a reputed national and international university is required, ideally in a relevant discipline such as business administration, entrepreneurship, or finance.",
      "Affinity and experience in working with young, vibrant, and dynamic teams, including aspiring and established entrepreneurs, as well as, experts in Bangladesh and beyond."
    ],
    "other_info": [
      {
        "category": "Time commitment",
        "info": "Full time, paid role for 40 hours per week from Sunday to Thursday"
      },
      {
        "category": "Location",
        "info": "9th Floor, Grameen Telecom Bhaban, Zoo Road, Mirpur 1, Dhaka 1216"
      },
      {
        "category": "Benefits",
        "info": "Competitive remuneration package with two annual festival bonuses, a generous leave policy, opportunities for training and travel, and an organisational culture that values continuous learning and innovation, high performance, and social impact."
      },
      {
        "category": "Application deadline",
        "info": "Immediately as applications will be reviewed on a rolling basis."
      },
      {
        "category": "Reporting to",
        "info": "Community Lead"
      },
      {
        "category": "Start date",
        "info": "October 1, 2022"
      }
    ],
    "footer": ""
  }
]
